from pprint import pprint

# 1. Створення словника з описом авто
car = {
    "модель": "Toyota RAV4 Hybrid",
    "ціна": 1485000,
    "робочий_обєм_двигуна": "2.5 л",
    "повна_маса": "2190 кг",
    "максимальна_швидкість": "180 км/год",
    "витрата_пального_на_100_км": "5.6 л",
    "особливості_інтерєру": [
        "Шкіряне кермо",
        "Підігрів передніх сидінь",
        "Двозонний клімат-контроль",
        "Медіасистема з 8-дюймовим екраном"
    ],
    "параметри_багажного_відділення": {
        "обєм_багажника": "580 л",
        "обєм_багажника_зі_складеними_сидіннями": "1690 л"
    }
}

pprint(car)

# 2. Додавання інформації про максимальну дозволену масу причепа з гальмами
car["маса_причепа_з_гальмами"] = "1500 кг"

# 3. Отримання інформації зі словника
назва_авто = car["модель"]
ціна_авто = car["ціна"]
перша_опція = car["особливості_інтерєру"][0]
обєм_багажника_зі_складеними = car["параметри_багажного_відділення"]["обєм_багажника_зі_складеними_сидіннями"]

print(назва_авто)
print(ціна_авто)
print(перша_опція)
print(обєм_багажника_зі_складеними)

# Страховий платіж 0.5% від вартості авто
страховий_платіж = car["ціна"] * 0.005
car["страховий_платіж"] = страховий_платіж
print(страховий_платіж)

# Вартість мандрівки на 200 км при ціні бензину 93 грн/літр
витрата_на_100_км = 5.6
ціна_бензину = 93
вартість_200_км = (витрата_на_100_км * 2) * ціна_бензину
print(вартість_200_км)